<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#DataFrame对象" data-toc-modified-id="DataFrame对象-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>DataFrame对象</a></span><ul class="toc-item"><li><span><a href="#什么是DataFrame对象" data-toc-modified-id="什么是DataFrame对象-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>什么是DataFrame对象</a></span></li><li><span><a href="#DataFrame对象的创建" data-toc-modified-id="DataFrame对象的创建-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>DataFrame对象的创建</a></span><ul class="toc-item"><li><span><a href="#pd.DataFrame(data,-index,-columns)" data-toc-modified-id="pd.DataFrame(data,-index,-columns)-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>pd.DataFrame(data, index, columns)</a></span><ul class="toc-item"><li><span><a href="#data是一个字典" data-toc-modified-id="data是一个字典-1.2.1.1"><span class="toc-item-num">1.2.1.1&nbsp;&nbsp;</span>data是一个字典</a></span></li><li><span><a href="#data是一个二维数组" data-toc-modified-id="data是一个二维数组-1.2.1.2"><span class="toc-item-num">1.2.1.2&nbsp;&nbsp;</span>data是一个二维数组</a></span></li></ul></li></ul></li><li><span><a href="#DataFrame对象的一些常用属性和方法" data-toc-modified-id="DataFrame对象的一些常用属性和方法-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>DataFrame对象的一些常用属性和方法</a></span><ul class="toc-item"><li><span><a href="#df.shape查看形状" data-toc-modified-id="df.shape查看形状-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>df.shape查看形状</a></span></li><li><span><a href="#df.index查看行索引" data-toc-modified-id="df.index查看行索引-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>df.index查看行索引</a></span></li><li><span><a href="#df.columns查看列名称" data-toc-modified-id="df.columns查看列名称-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>df.columns查看列名称</a></span></li><li><span><a href="#df.info()查看数据的字段的具体信息" data-toc-modified-id="df.info()查看数据的字段的具体信息-1.3.4"><span class="toc-item-num">1.3.4&nbsp;&nbsp;</span>df.info()查看数据的字段的具体信息</a></span></li><li><span><a href="#df.describe()描述性统计查看" data-toc-modified-id="df.describe()描述性统计查看-1.3.5"><span class="toc-item-num">1.3.5&nbsp;&nbsp;</span>df.describe()描述性统计查看</a></span></li><li><span><a href="#df.set_index(列名)" data-toc-modified-id="df.set_index(列名)-1.3.6"><span class="toc-item-num">1.3.6&nbsp;&nbsp;</span>df.set_index(列名)</a></span></li><li><span><a href="#df.sort_index()按照索引进行排序" data-toc-modified-id="df.sort_index()按照索引进行排序-1.3.7"><span class="toc-item-num">1.3.7&nbsp;&nbsp;</span>df.sort_index()按照索引进行排序</a></span></li><li><span><a href="#df.sort_values()--按照值进行排序" data-toc-modified-id="df.sort_values()--按照值进行排序-1.3.8"><span class="toc-item-num">1.3.8&nbsp;&nbsp;</span>df.sort_values()  按照值进行排序</a></span></li><li><span><a href="#df.drop_duplicates(subset=['A','B'],keep='first',inplace=True)删除重复行" data-toc-modified-id="df.drop_duplicates(subset=['A','B'],keep='first',inplace=True)删除重复行-1.3.9"><span class="toc-item-num">1.3.9&nbsp;&nbsp;</span>df.drop_duplicates(subset=['A','B'],keep='first',inplace=True)删除重复行</a></span></li><li><span><a href="#np.isnull()查看缺失值情况" data-toc-modified-id="np.isnull()查看缺失值情况-1.3.10"><span class="toc-item-num">1.3.10&nbsp;&nbsp;</span>np.isnull()查看缺失值情况</a></span></li><li><span><a href="#df.fillna()缺失值填充" data-toc-modified-id="df.fillna()缺失值填充-1.3.11"><span class="toc-item-num">1.3.11&nbsp;&nbsp;</span>df.fillna()缺失值填充</a></span></li></ul></li></ul></li></ul></div>

In [1]:
#全部行都能输出
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import numpy as np
import pandas as pd

# DataFrame对象

## 什么是DataFrame对象

DataFrame是一个可以包含不同数据类型的列的二维数据结构，  
类似于电子表格或SQL表，**是最常用的pandas对象**。

## DataFrame对象的创建

### pd.DataFrame(data, index, columns)

#### data是一个字典

In [3]:
#使用包含列表的字典创建DataFrame时,各个列表内元素个数必须一致
data = {'人物姓名':['小明','小高','小婉'],   #默认字典的键为dataframe的字段名,不设定索引的时候,自动给出默认索引,从0到len(list)-1
         '语文':[88,90,67],
         '数学':[60,40,100],
         '英语':[78, 89, 87]
         }
data

{'人物姓名': ['小明', '小高', '小婉'],
 '语文': [88, 90, 67],
 '数学': [60, 40, 100],
 '英语': [78, 89, 87]}

In [4]:
df = pd.DataFrame(data)
df

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

#### data是一个二维数组  
pd.DataFrame(data, index, columns)  
data作为值  
index作为行索引  
columns作为列索引

In [5]:
#把一个二维数组转化为一个DataFrame
a = np.zeros((4, 6))
a

array([[0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.]])

In [6]:
pd.DataFrame(a)  # 行和列自动从零开始补

     0    1    2    3    4    5
0  0.0  0.0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0  0.0  0.0

In [7]:
df = pd.DataFrame(a, index=['a', 'b', 'c', 'd'], columns=['A', 'B', 'C', 'D', 'E', 'F']) 
df

     A    B    C    D    E    F
a  0.0  0.0  0.0  0.0  0.0  0.0
b  0.0  0.0  0.0  0.0  0.0  0.0
c  0.0  0.0  0.0  0.0  0.0  0.0
d  0.0  0.0  0.0  0.0  0.0  0.0

## DataFrame对象的一些常用属性和方法

### df.shape查看形状

In [8]:
df

     A    B    C    D    E    F
a  0.0  0.0  0.0  0.0  0.0  0.0
b  0.0  0.0  0.0  0.0  0.0  0.0
c  0.0  0.0  0.0  0.0  0.0  0.0
d  0.0  0.0  0.0  0.0  0.0  0.0

In [9]:
df.shape

(4, 6)

### df.index查看行索引

In [10]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

### df.columns查看列名称

In [11]:
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

### df.info()查看数据的字段的具体信息

In [12]:

data = {'人物姓名':['小明','小高','小婉'],   
         '语文':[88,90,67],
         '数学':[60,40,100],
         '英语':[78, 89, np.nan]
         }
data

{'人物姓名': ['小明', '小高', '小婉'],
 '语文': [88, 90, 67],
 '数学': [60, 40, 100],
 '英语': [78, 89, nan]}

In [13]:
df = pd.DataFrame(data)
df

  人物姓名  语文   数学    英语
0   小明  88   60  78.0
1   小高  90   40  89.0
2   小婉  67  100   NaN

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
人物姓名    3 non-null object
语文      3 non-null int64
数学      3 non-null int64
英语      2 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

### df.describe()描述性统计查看

In [15]:
df.describe()

              语文          数学         英语
count   3.000000    3.000000   2.000000
mean   81.666667   66.666667  83.500000
std    12.741010   30.550505   7.778175
min    67.000000   40.000000  78.000000
25%    77.500000   50.000000  80.750000
50%    88.000000   60.000000  83.500000
75%    89.000000   80.000000  86.250000
max    90.000000  100.000000  89.000000

In [16]:
df.describe().T

    count       mean        std   min    25%   50%    75%    max
语文    3.0  81.666667  12.741010  67.0  77.50  88.0  89.00   90.0
数学    3.0  66.666667  30.550505  40.0  50.00  60.0  80.00  100.0
英语    2.0  83.500000   7.778175  78.0  80.75  83.5  86.25   89.0

### df.set_index(列名)  
把该列设置为索引

In [17]:
df

  人物姓名  语文   数学    英语
0   小明  88   60  78.0
1   小高  90   40  89.0
2   小婉  67  100   NaN

In [18]:
df.set_index('人物姓名')

      语文   数学    英语
人物姓名
小明    88   60  78.0
小高    90   40  89.0
小婉    67  100   NaN

### df.sort_index()按照索引进行排序

In [19]:
df

  人物姓名  语文   数学    英语
0   小明  88   60  78.0
1   小高  90   40  89.0
2   小婉  67  100   NaN

In [20]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
df.index = ['003', '001', '002']

In [22]:
df

    人物姓名  语文   数学    英语
003   小明  88   60  78.0
001   小高  90   40  89.0
002   小婉  67  100   NaN

In [23]:
df.sort_index()   # 默认进行升序

    人物姓名  语文   数学    英语
001   小高  90   40  89.0
002   小婉  67  100   NaN
003   小明  88   60  78.0

In [24]:
df.sort_index(ascending=False)  # ascending=False则按索引降序

    人物姓名  语文   数学    英语
003   小明  88   60  78.0
002   小婉  67  100   NaN
001   小高  90   40  89.0

### df.sort_values()  按照值进行排序

In [25]:
df

    人物姓名  语文   数学    英语
003   小明  88   60  78.0
001   小高  90   40  89.0
002   小婉  67  100   NaN

In [26]:
df.sort_values(by='语文')  # 默认进行升序

    人物姓名  语文   数学    英语
002   小婉  67  100   NaN
003   小明  88   60  78.0
001   小高  90   40  89.0

In [27]:
df.sort_values('英语')

    人物姓名  语文   数学    英语
003   小明  88   60  78.0
001   小高  90   40  89.0
002   小婉  67  100   NaN

In [28]:
df.sort_values('数学')

    人物姓名  语文   数学    英语
001   小高  90   40  89.0
003   小明  88   60  78.0
002   小婉  67  100   NaN

In [29]:
df.sort_values('数学', ascending=False)  # 按数学进行降序

    人物姓名  语文   数学    英语
002   小婉  67  100   NaN
003   小明  88   60  78.0
001   小高  90   40  89.0

**按多个值进行升序**

In [30]:
df

    人物姓名  语文   数学    英语
003   小明  88   60  78.0
001   小高  90   40  89.0
002   小婉  67  100   NaN

In [31]:
df.sort_values(['数学', '英语'], ascending=False)

    人物姓名  语文   数学    英语
002   小婉  67  100   NaN
003   小明  88   60  78.0
001   小高  90   40  89.0

### df.drop_duplicates(subset=['A','B'],keep='first',inplace=True)删除重复行  
- 代码中subset对应的值是列名，表示只考虑这两列，将这两列对应值相同的行进行去重。默认值为subset=None表示考虑所有列。
- keep='first'表示保留第一次出现的重复行，是默认值。keep另外两个取值为"last"和False，分别表示保留最后一次出现的重复行和去除所有重复行。
- inplace=True表示直接在原来的DataFrame上删除重复项，而默认值False表示生成一个副本。

In [35]:
df = pd.DataFrame({'姓名':['李四', '张三', '李四', '王五'], 
                   '语文':[78, 90, 78, np.nan]})
df

   姓名    语文
0  李四  78.0
1  张三  90.0
2  李四  78.0
3  王五   NaN

In [36]:
df.drop_duplicates()  # 去重

   姓名    语文
0  李四  78.0
1  张三  90.0
3  王五   NaN

### np.isnull()查看缺失值情况

In [43]:
df

   姓名    语文
0  李四  78.0
1  张三  90.0
2  李四  78.0
3  王五   NaN

In [44]:
df.isnull().sum()

姓名    0
语文    1
dtype: int64

In [45]:
df.isnull().sum()/df.shape[0]

姓名    0.00
语文    0.25
dtype: float64

### df.fillna()缺失值填充

In [47]:
df.fillna(0)

   姓名    语文
0  李四  78.0
1  张三  90.0
2  李四  78.0
3  王五   0.0

In [54]:
df.语文.fillna(df.语文.mean())

0    78.0
1    90.0
2    78.0
3    82.0
Name: 语文, dtype: float64